{
  "title": "Well, I'm voting straight-ticket Republican, Trump and all",
  "text": "I made this username a couple years ago and that was my sentiment at the time. I was never a 'vote blue no matter who' type because that mentality allows the DNC to do whatever they want, and I frankly won't be told to fall in line. I voted 3rd party in '04, Obama in '08, 3rd party in '12 and '16. State and local politicians I've voted for have mostly been Democrat. My views have never fallen cleanly on one side or the other, but I've mostly leaned liberal.\n\nThis brings me to Why I'm Voting Republican:  \n1. Woke shit. I've been on the receiving end of woke hatred over men who fancy themselves women for a long time. I'm well acquainted with critical theory and all its crazy spawn. I'm not down for the struggle sessions, the authoritarianism, the illiberal silencing of dissent. Now that we have Evergreen playing out in the streets, schools, and HR departments across the Western world, I have no choice but to vote for the party standing against it. This alone would be enough for me to vote for Trump.  \n2. Media is lying to me. I believed those pictures of kids in cages were put there by Trump. I believed the shooting of Breonna Taylor was the result of a no-knock warrant executed on the wrong address. I believed Trump said neo-Nazis and white supremacists marching with tiki torches were \"fine people.\" Turns out I was a sucker, and god damn am I *tired* of this \"peaceful protester\" shit the media is on about.  \n3. Fuck the DNC. I wanted Bernie in 2016 and we all know how dirty they did him. When Trump won, my immediate thought was 'at least the DNC will learn their fucking lesson.' Well friends, they're much more resistant to learning than I anticipated. This time around there were a few candidates I could have gotten on board with, but of course the DNC won't let anyone remotely subversive get on the ticket. Fuck em.  \n4. LAW AND ORDER. I live in Oregon. It's not going well. Fuck antifa. Fuck BLM. Fuck Kate Brown. Fuck Ted Wheeler. Fuck everyone allowing tent cities full of junkies to blight the landscape. Fuck every 'ACAB' sniveling child.  \n5. Yay middle east peace deals.  \n6. Fuck China.  \n7. Biden is frail and will be 78 and Harris is terrifying and I haaaate her.  \n8. Working class. I don't know when the Democrats decided they weren't the party of labor, but now they mostly look down their ivory tower noses at anyone with a little mud on their boots.  \n9. Democrats talking about court packing. No, no, no, hell no.  \n10. Democrats talking about getting rid of the electoral college, thus disenfranchising the interests of rural people. Nope, never gonna happen.  \n11. I'm patriotic. I don't like that seeing an American flag on someone's house, vehicle, or clothing is a pretty good indicator of them being a Republican. Regarding the Democrat party and liberals in general, where is their love of country? “National pride is to countries what self-respect is to individuals: a necessary condition for self-improvement.” ― Richard Rorty\n\nAs for Trump himself, I think he's a boor. But he's not as big of a bastard as I had believed and I understand him a bit better. He's gonna win for sure, which is not something I thought before the riots started. I'm preemptively pissed about the future of abortion rights, but at least my free speech and gun rights will remain intact. With those two, I have a seat at the table to fight for the rest. \n\nI'm honestly hoping for a landslide because I think it might be the only thing that can slap liberals hard enough they wake up and get on a better path. The nation works best when there is a healthy push and pull between liberalism and conservatism, and we need to be able to agree on the foundational structures of our country. I see a huge number of left-leaning people refusing to come to the table to talk and wanting to break our system when they don't get their way, and making it clear that won't win them power is the issue of the election.",
  "score": 1085,
  "created_utc": "2020-10-12T04:24:14",
  "subreddit": "republican"
}