{
  "title": "Longtime D voting R this year",
  "text": "As I reminded myself this is the same media from 2001 that convinced their own people it was okay to bomb and completely destabilize the Middle East “because they had ISIS”, I decided to open my mind.\n\nI attended BOTH rallies, Trump’s and Biden’s and needless to say, my mind was blown when I went to Trump’s. I never experienced such a magnitude of patriotism and unity. Numerous black people and other POCs were there, the majority of mainstream news would never show that. They looked happy and they were being treated equally from what I saw. People didn’t even treat them like black people, they were regular people like all other people. The primary message of the rally was to make our country better and the vibes were nothing but positive and energetic. In comparison, Biden’s rally was all about why Trump is a bad president and the energy was absolutely negative. People were angry and bitter, looking as if they were ready to beat up whoever expressed their support for Trump. This opened my eyes and made me realize where the hatred is truly coming from. As a longtime Democrat, I will be voting for Trump. We must start improving our country through unity, love, and positivity, which is completely opposite from what Democrats want at the moment.\n\nEdit 1: clarification: what I mean by “People didn’t treat them like black people” is that they did not intentionally sympathize and treat them like victims just because they were black. They treated them like all other people regardless of the skin color. Sorry, English isn’t my first language and the wording could have been better.\n\nEdit 2: thank you so much for all the awards! Never had an award before. :) This kind of outcome is not what I expected, let’s continue to stay united!\n\nEdit 3: if you reported this post or feel the need to report, I strongly encourage you to open your mind and attend BOTH events instead of having all your thoughts formed by the mainstream news. Ability to keep your mind open and listen to both sides through unbiased lens is an extremely vital skill to have nowadays. If you still don’t agree with me, I still love you and will never treat you differently solely because of your political stance. Cheers!",
  "score": 1534,
  "created_utc": "2020-09-18T00:41:18",
  "subreddit": "republican"
}