{
  "title": "Why I, a black teenager, don't agree with black lives matter",
  "text": "Before people spam \"whitewashed\", I wanna make it clear that this isn't just gonna be some trash racist post\n\nI feel like the message created by black lives matter is very different to that of the civil rights movement 56 years ago. That movement was one that strived to end both racial division and racial inequality. I can certainly see the stance against racial inequality in BLM, but not racial division.\n\nMLK preached to Americans about black and white Americans being in unison. He promoted the meaning of America's creed, and promoted that black and white destiny are part of one another. He had a dream where the black and white people identified as Americans before they identified by their colour. Unfortunately, this is not the message BLM creates.\n\nBLM has managed to make white people who have felt prejudice towards black people feel even stronger about this by creating demands like defunding police departments (And there is no denying,  police do far more good than harm in society, so defunding them will reduce a lot of the good they do) and by tearing down and destroying the history of countries (such as statues in America and Britain). These attacks on history are like an attack on the pride of people who feel strongly about the importance of their country's history. It has also managed to make black people who strongly hate racism hate it to the point where they want to fight it through violence, and has convinced them that racism is the blame for all problems in their lives.\n\nAs you can see above, the message created by BLM is very different to that of the civil rights movement, and I think it's almost like an insult to the legacy of MLK that this is where the struggle against racism has come to.\n\nAnother problem with BLM is the fight against systematic racism they preach about, because the truth is, systematic simply isn't real. Every citizen in countries like America has complete equality of opportunity. Everyone is given an equal opportunity to rise to the top. However, not everyone has the same starting point. And the truth is, a higher proportion of the black population in America and these countries begins at a low starting point than the proportion of white people who do. But this isn't because of systematic racism. The system isn't causing this. This is because of historical racism. For the majority of it's history, America has been a racist country, where people of certain skin colours do not have equal opportunities. There has been equality for only 56 years, compared to the roughly 200 years of systematic racisn. This means that, no matter what the system does, there is still going to be inequality between majority black and majority white communities. This is something everyone must accept, and must understand that the solution to this comes in two parts. The government providing funding to black communities to go towards education and quality of life, and black people in these communities understanding that they must take responsibility for their futures and their families' futures (meaning that this mentality of blaming systematic racism must stop).\n\nI feel like the solution to all of this is a movement that wouldn't use methods of violence whatsoever, and instead of protesting against systematic racism which simply isn't real, it should preach to Americans of all races the importance of American values, which seem to have been forgotten over the generations. Through this, I hope, Americans can become united under a single national culture, and would no longer see themselves as divided from each other. It would also convince people in black communities to stop the ideas in black culture that have caused a lack of responsibility, causing things like single motherhood rate since the civil rights movement to go up by 40%.\n\nI doubt that this message will reach many people. Mabye it will be censored. Mabye it will be ignored because of my age. But I really hope to see changes in how the world views race, changes I know we can reach, but not in the way we are currently doing it.\n\nEdit: Thank you for 1k upvotes. It feels great to know that people actually agreed with this.",
  "score": 1428,
  "created_utc": "2020-06-20T02:22:50",
  "subreddit": "republican"
}