{
  "title": "Voting FOR My Interests",
  "text": "I’ve been quiet this election, not wanting to rock the boat. But since it’s Election Day. I’m gonna ask you - if you’re voting for a candidate who didn’t even have a primary election because you have a gay or transgender friend of family member, and you “care about their interests,” as a gay man diagnosed with gender dysphoria here are my interests:\n\n-A secure border\n- An end to funding wars \n-The protection of human life at all stages from from conception to natural death\n- The protection of children from a billion dollar industry that wants to mutilate their bodies before they turn 18\n- The protection of femboys and Tom boys who would grow up in any other age to just be gay or gender non conforming\n- The right to 100% free speech - freedom of speech IS freedom from consequences from the government \n- The right to have the first female  president win because she is better than any man in power - not because she is a DEI\n- The protection of women from men invading their spaces\n- The protection from the state forcing a sh0t onto me\n- The protection of my religion (Christianity) from an atheist death cult \n- The protection of illégal migrant children and innocent refugees (make them citizens, not slaves)\n- The continued criminalization of mind altering drugs \n- The protection from sterilizing children who aren’t trusted to drink or vote or get a tattoo, but for some reason can destroy their bodies \n- The right to “just be gay” \n- The protection from erasure of the homosexual and lesbian communities by the alphabet mafia who seek to redefine what gay is \n- The protection from transgender people from military service \n\nTrump didn’t get rid of gay marriage back in 2016, when he had a Republican super majority. He does not endorse Pr0ject 2025. He did not ban transitioning for consenting adults. He did not not ban gay people from adopting. So if you’re voting today (which I beg you to do) because you “care about the interests” of your gay friends and family? Well I’m gay, and here’s my interests.\n",
  "score": 1096,
  "created_utc": "2024-11-05T14:14:16",
  "subreddit": "republican"
}