{
  "title": "First Time Voter",
  "text": "For the first time in my life, I was drawn out to vote. \n\nI have never had a political bone in my body. \n\nI was annoyingly indifferent about the entire American project. \n\nSo, with a heavy heart, I found it no longer acceptable to be inactive. \n\nI felt compelled to vote not for anything but rather against so much.\n\nI have watched Donald Trump flaunt his self-serving destruction of our nation's norms. Mutating good Americans into the type of people who denigrate the very essence of what it means to be an American.\n\nHe has corrupted so many fine and upstanding people. \n\nFolks I knew to be kind and good-hearted regurgitating some of the most vial talking points and excusing some of the most sick moral failures of the former president. \n\nTo name a few that come to mind.\n\nTrump had an affair 4 months after his wife gave birth. \n\nTrump was convicted in front of a jury of his peers that he had r*ped E. Jean Carroll according to the common definition of the word.\n\nTrump plotted to steal the 2020 election by attempting to pressure Mike Pence under threat of violence into certifying Trump's false slate of electors. \n\nAs the mob chanted \"hang Mike Pence,\" Trump tweeted, \"Mike Pence didn't have the courage to do what should have been done.\" \n\nTrump believes that half the population should be considered \"the enemy within.\" \n\nHe has degraded prisoners of war, saying, \"I like people who weren't captured.\" \n\nAll of these have been either dismissed or praised by American \"Patriots.\" \n\nHis cult followers will defend all his unacceptable behavior by saying, \"It's all jokes\" or \"It's the liberal media.\" \n\nDefenses that only further highlight how much he has melted the minds of these people.\n\nIt's clear that all these criticisms are not baseless attacks. They are part of an established pattern of behavior that has been validated time and time again by folks with wide-ranging relationships with Trump. \n\nFrom former staffers, government and military professionals, members of his cabinet, judges, family members, business partners, experts, and many others. \n\nFolks from each group all share the same resounding and clear message. \n\nIt's the message that drove me to vote, and it's a message I would like to echo here.\n\nDonald Trump is not fit to be the next president of the United States.",
  "score": 2965,
  "created_utc": "2024-11-05T05:29:50",
  "subreddit": "democrats"
}