{
  "title": "No, 20 million Democrats did not just “not show up.”",
  "text": "I have been seeing this very misguided idea floating around this sub, so I’ve decided to put it to rest by calculating the remaining vote and seeing how we can expect it to add up. I’m only calculating the substantial remaining vote, meaning I’m not doing it for states that are 99% reported, as that would take forever. I’ll cluster those together in a lazy calculation at the end.\n\nCalifornia — 7,520,900 votes to be counted.\n\nAssuming current splits hold up (though these votes may be more heavily in Harris’s favor):\n\nHarris — 4,332,038 Votes\nTrump - 2,985,796 Votes\n\nOregon — 257,107 votes to be counted\n\nHarris — 257,107 votes\nTrump — 197,631 votes\n\nWashington — 509,070 votes to be counted\n\nHarris — 297,296 votes\nTrump — 198,028 votes\n\nMaryland — 550,074 votes to be counted\n\nHarris — 333,894 votes\nTrump — 201,877 votes\n\nArizona — 825,835 votes to be counted\n\nHarris — 384,839 votes\nTrump — 433,563 votes\n\nNevada — 134,357 votes to be counted\n\nHarris — 63,416 votes\nTrump — 68,522 votes\n\nNow we will assume that every other state is collectively 99.5% reported, meaning ~715,567 votes remain. Since this is between both red and blue states, I’ll just assume a 50/50 split on these votes.\n\nThis means **10,512,910** votes have yet to be reported.\n\nThis brings the final expected popular vote total to:\n\nHarris — 75,054,105 \nTrump — 77,813,469 \n\nOverall: 152,867,574 votes\n\nCompare to 2020:\n\nBiden: 81,283,501\nTrump: 74,223,975\n\nOverall: 155,507,476\n\nThis means that 2024 turnout will be approximately **98.3%** of 2020 turnout.\n\nSo no, it is not true that we lost because “20 million Democrats just couldn’t get off the couch.” Unfortunately, there was just an overall substantial rightward shift, which aligns with the incumbency disadvantage we’ve been seeing globally due to inflation. ",
  "score": 2612,
  "created_utc": "2024-11-08T02:58:50",
  "subreddit": "democrats"
}